["What’s the best time to see a dentist? Tooth hurty.","What’s the difference between a hippo and a Zippo? One is heavy and one is a lot lighter.","Why shouldn’t you write with a dull pencil? Because it’s pointless.","How much does an influencer weigh? An Instagram.","What do you get when you combine a rhetorical question and a joke?","What’s the derivative of Amazon? Amazon Prime.","Why was the broom late for a meeting? It overswept.","How did the hipster burn his mouth? He sipped his coffee before it was cool.","What do you call Batman if he skips church? Christian Bale!","I used to hate body hair, but then it grew on me.","What do you call a bear with no teeth? A gummy bear.","What kind of dinosaur has the biggest vocabulary? The thesaurus!","What did the grape do when it got stomped on? It let out a little wine.","What’s the best part about Switzerland? The flag is a big plus.","What did the buffalo say when his son left? Bison!","What do you call a fake noodle? An impasta (sus)!","Did you know the first French fries weren’t cooked in France? They were cooked in Greece!","What do carb-loving zombies eat? Graaaaaaaains.","Two cannibals are eating a clown. One asks the other, “Does this taste funny to you?”","Does anyone need an ark? I Noah guy.","Why did the picture go to jail? Because it was framed!","Have you heard the joke about the bed? No? That’s because it hasn’t been made yet.","Why can’t wildcats take tests? There are too many cheetahs.","What do you call a can opener that doesn’t work? A can’t opener.","Why shouldn’t you make a “dad joke” if you’re not a dad? Because it’s a faux pa.","A man died after drinking varnish. It was a terrible end, but a beautiful finish.","What’s the difference between Prince William and a tennis ball? One is heir to the throne and one is thrown in the air.","What concert is worth just 45 cents? 50 Cent and Nickelback.","Why can’t a hand be 12 inches long? Because then it’d be a foot.","What’s the difference between a dapper man on a bicycle and a poorly dressed man on a unicycle? Attire!","I left my job at a shoe disposal plant. It was sole destroying.","The past, the present and the future walked into a bar. It was tense.","What did the thumb say to the finger? “I’m in glove with you.”","What does a nosy pepper do? It gets jalapeno business!","Parallel lines have so much in common. It’s a shame they’ll never meet.","There are three types of people in this world: People who are good at math and people who are not.","Two guys walks into a bar. The third guy ducks.","Why do ghosts love elevators? Because they lift their spirits.","What do you call a snobby criminal going downstairs? A condescending con descending.","What can you do if you’re scared of elevators? Take steps to avoid them.","How do prisoners communicate with one another? Cell phones.","How many bugs do you need to rent out an apartment? Tenants.","What did one elevator say to the other? “I think I’m coming down with something.”","What’s a foot’s favorite snack? Dori-toes.","The shovel was a truly groundbreaking invention.","You know why they called it “the dark ages?” There were too many knights.","What’s the loudest kind of pet you can get? A trumpet.","The rotation of the earth really makes my day.","Why do seagulls fly over the sea? Because if they flew over the bay, they’d be called bagels.","What did the animals tell Simba when he walked too slow? Mufasa!","What do you call Samsung’s security team? The Guardians of the Galaxy!","I sold my vacuum yesterday. It was just collecting dust.","What kind of tea is hardest to swallow? Reality.","Why did the golfer need new pants? Because he got a hole in one.","Why did the man get fired from the calendar factory? Because he took a few days off.","What do you call an alligator wearing a vest? An investigator.","How do snails fight? They slug it out.","What do you call someone who points out the obvious? Someone who points out the obvious.","What sound does a nut make when it sneezes? Cashew!","Did you hear about the satellites’ wedding? The ceremony was OK, but the reception was terrific.","What did the Atlantic Ocean say to the Pacific Ocean? Nothing, it just waved.","Which school supply is king? The ruler.","What do you get when you cross a vampire with a snowman? Frostbite.","What do you call a person with no body and no nose? Nobody knows.","What’s green and sings? Elvis Parsley.","How do you make holy water? You boil the hell out of it.","A jumper cable walks into a bar. The bartender says, “I’ll serve you, but don’t start anything.”","What’s the worst part of being an egg? You only get laid once (and it’s with your mom)!","Three fish are in a tank. One asked the others, “How the heck do you drive this thing?”","How do you catch a bra? With a booby trap.","How many tickles can an octopus take? Tentacles!","What do clouds wear under their shorts? Thunderpants.","Did you hear about the guy who won the award for best knock knock joke? He won the no bell prize.","Why did Cinderella get kicked off of the soccer team? Because she kept running from the ball!","How many ears do space aliens have? Three: The left ear, right ear and the final front ear.","Cosmetic surgery used to be taboo, but now when you talk about Botox no one raises an eyebrow.","Did you hear the one about the three watering holes in the ground? Well, well, well…","What did the socks say to the pants? “‘Sup britches?!”","What shivers at the bottom of the ocean? A nervous wreck.","What’s a ninja’s favorite type of shoes? Sneakers!","I have the world’s worst thesaurus. Not only is it terrible, it’s also terrible.","What do hillbillies drink from? Hiccups.","What’s even better than Ted Danson? Ted singing and Danson.","Why did the invisible man turn down a job offer? He couldn’t see himself doing it.","What kind of music do windmills like? They’re metal fans.","What do you call a fish with two knees? A tunee fish.","I’d tell you the joke about perforated paper, but it’s tear-able.","What do you call someone else’s cheese? Nacho cheese!","What do you call a canine magician? A labracadabrador.","Why did the snowman pick through a bag of carrots? Because he was picking his nose.","Why does Waldo only wear stripes? Because he doesn’t want to be spotted.","I tried buying camouflage the other day but I couldn’t find any.","What did one bean say to the other? “How you bean?”","Why did the coffee call the police? It got mugged!","Why did Cyclops close his school? He only had one pupil.","Where do skunks pray? In pews.","If you’re American when you come out of the bathroom, what are you when you’re in the bathroom? European.","Why do birds fly south for the winter? Because it’s too far to walk.","How did Darth Vader know what Luke Skywalker got him for Christmas? He felt his presents.","What was the mummy’s favorite type of music? Wrap.","I’m only familiar with 25 letters of the alphabet. I don’t know why.","Did you hear about the beautiful wedding? Even the cake was in tiers.","Why are there fences are cemeteries? Because everyone’s always dying to get in.","A company is making glass coffins. Whether they’re successful remains to be seen.","What did one wall say to the other? “Meet me at the corner!”","What do you call a large African mammal with long hair and sandals? A hippie-potamus.","How do you think the unthinkable? With an itheberg!","What’s the award for being the best dentist? A plaque.","Why can’t you hear a pterodactyl go to the bathroom? Because the P is silent.","I bought sneakers from a drug dealer. I don’t know what he laced them with but I’ve been tripping all day!","Why did Mozart hate chickens? Because when he asked them for their favorite composer, they said, “Bach! Bach! Bach!”","Why did the toilet paper roll downhill? To get to the bottom.","What’s the best name for a man who can’t stand? Neil.","What do you call a deer with no eyes? No eyed deer.","Why are groups of fish so smart? Because they travel in schools.","How much does the heaviest skeleton weigh? A skeleton.","What did the drummer name her twin daughters? Anna One, Anna Two.","What’s big, gray and doesn’t matter? An irrelephant.","Why did the scarecrow get promoted? Because he was outstanding in his field.","Why does Snoop Dogg carry an umbrella? Fo’ drizzle.","What do you call a pony with a sore throat? A little hoarse.","What do you call a fish with no eye? Fsh.","What do you call a boomerang that doesn’t come back? A stick!","What kind of car does an egg drive? A Yolkswagen.","What do you call a factory that sells generally decent goods? A satisfactory.","Why was 6 afraid of 7? Because 7 ate 9.","Why should you never eat a clock? Because it’s too time consuming.","What should a sick bird do? Get tweetment.","I want a job cleaning mirrors. It’s something I can really see myself doing.","What grades did the pirate get on his report card? Seven Cs.","How do you make a tissue dance? Put a little boogie in it.","How did Ebenezer Scrooge win the football game? The ghost of Christmas passed!","Did you hear about the mediocre restaurant on the moon? It has great food but no atmosphere.","What kinds of pictures do hermit crabs take? Shellfies.","What do you get a man with the heart of a lion? A lifetime ban from the zoo.","What do you call a person with a briefcase in a tree? A branch manager.","Why did the baby cookie cry? Because its mother was a wafer so long.","What’s the difference between an alligator and a crocodile? One you’ll see later, the other you’ll see in a while.","When is a door not really a door? When it’s really ajar.","What do you do when you see a spaceman? Park in it, man.","Why do you never see elephants hiding in trees? Because they’re so good at it!","Did you hear about the claustrophobic astronaut? Poor guy really needed some space."]