["What’s the best time to see a dentist? Tooth hurty.","How much does an influencer weigh? An Instagram.","What’s the derivative of Amazon? Amazon Prime.","How did the hipster burn his mouth? He sipped his coffee before it was cool.","What kind of dinosaur has the biggest vocabulary? The thesaurus!","What did the grape do when it got stomped on? It let out a little wine.","What do you call a fake noodle? An impasta (sus)!","Did you know the first French fries weren’t cooked in France? They were cooked in Greece!","Does anyone need an ark? I Noah guy.","Why can’t wildcats take tests? There are too many cheetahs.","What do you call a can opener that doesn’t work? A can’t opener.","A man died after drinking varnish. It was a terrible end, but a beautiful finish.","Why can’t a hand be 12 inches long? Because then it’d be a foot.","What’s the difference between a dapper man on a bicycle and a poorly dressed man on a unicycle? Attire!","I left my job at a shoe disposal plant. It was sole destroying.","The past, the present and the future walked into a bar. It was tense.","What does a nosy pepper do? It gets jalapeno business!","Parallel lines have so much in common. It’s a shame they’ll never meet.","There are three types of people in this world: People who are good at math and people who are not.","What can you do if you’re scared of elevators? Take steps to avoid them.","How do prisoners communicate with one another? Cell phones.","What did one elevator say to the other? “I think I’m coming down with something.”","What’s a foot’s favorite snack? Dori-toes.","The shovel was a truly groundbreaking invention.","You know why they called it “the dark ages?” There were too many knights.","What’s the loudest kind of pet you can get? A trumpet.","The rotation of the earth really makes my day.","Why do seagulls fly over the sea? Because if they flew over the bay, they’d be called bagels.","What do you call Samsung’s security team? The Guardians of the Galaxy!","I sold my vacuum yesterday. It was just collecting dust.","What kind of tea is hardest to swallow? Reality.","Why did the golfer need new pants? Because he got a hole in one.","Why did the man get fired from the calendar factory? Because he took a few days off.","What do you call an alligator wearing a vest? An investigator.","How do snails fight? They slug it out.","What do you call someone who points out the obvious? Someone who points out the obvious.","What sound does a nut make when it sneezes? Cashew!","Did you hear about the satellites’ wedding? The ceremony was OK, but the reception was terrific.","What did the Atlantic Ocean say to the Pacific Ocean? Nothing, it just waved.","Which school supply is king? The ruler.","How do you make holy water? You boil the hell out of it.","A jumper cable walks into a bar. The bartender says, “I’ll serve you, but don’t start anything.”","How many tickles can an octopus take? Tentacles!","What do clouds wear under their shorts? Thunderpants.","Did you hear about the guy who won the award for best knock knock joke? He won the no bell prize.","Why did Cinderella get kicked off of the soccer team? Because she kept running from the ball!","How many ears do space aliens have? Three: The left ear, right ear and the final front ear.","Cosmetic surgery used to be taboo, but now when you talk about Botox no one raises an eyebrow.","What did the socks say to the pants? “‘Sup britches?!”","What shivers at the bottom of the ocean? A nervous wreck.","What’s even better than Ted Danson? Ted singing and Danson.","What kind of music do windmills like? They’re metal fans.","I’d tell you the joke about perforated paper, but it’s tear-able.","What do you call a canine magician? A labracadabrador.","Why did the snowman pick through a bag of carrots? Because he was picking his nose.","Why does Waldo only wear stripes? Because he doesn’t want to be spotted.","What did one bean say to the other? “How you bean?”","If you’re American when you come out of the bathroom, what are you when you’re in the bathroom? European.","How did Darth Vader know what Luke Skywalker got him for Christmas? He felt his presents.","Did you hear about the beautiful wedding? Even the cake was in tiers.","What did one wall say to the other? “Meet me at the corner!”","What do you call a large African mammal with long hair and sandals? A hippie-potamus.","How do you think the unthinkable? With an itheberg!","What’s the award for being the best dentist? A plaque.","Why did Mozart hate chickens? Because when he asked them for their favorite composer, they said, “Bach! Bach! Bach!”","What’s the best name for a man who can’t stand? Neil.","What do you call a deer with no eyes? No eyed deer.","What did the drummer name her twin daughters? Anna One, Anna Two.","Why does Snoop Dogg carry an umbrella? Fo’ drizzle.","What do you call a fish with no eye? Fsh.","Why was 6 afraid of 7? Because 7 ate 9.","What should a sick bird do? Get tweetment.","I want a job cleaning mirrors. It’s something I can really see myself doing.","How do you make a tissue dance? Put a little boogie in it.","How did Ebenezer Scrooge win the football game? The ghost of Christmas passed!","What kinds of pictures do hermit crabs take? Shellfies.","What do you call a person with a briefcase in a tree? A branch manager."]